"""Theme of these tasks are conditions and loops"""
from logging import exception

""" Задание 3: Строки и заглавные буквы
Напишите программу, которая принимает строку от пользователя и преобразует её таким образом, что:

Если строка начинается с гласной буквы (a, e, i, o, u), она полностью преобразуется в заглавные буквы.
Если строка начинается с согласной буквы, она полностью преобразуется в строчные буквы.
Если введена пустая строка, программа выводит сообщение об ошибке.
Подсказка: Используйте метод startswith() для проверки первой буквы строки.
"""

# 1 вариант

# 2 вариант
